import { createRoot } from "react-dom/client"
import { RouterProvider } from "react-router"

import "./index.css"
import { router } from "./router.tsx"

createRoot(document.getElementById("root")!).render(<RouterProvider router={router} />)

// TODO:
// Захистити роути (DONE! Залишилось перевірити)
// Під час оновлення профілю не оновлюється пошта (подивитись в better-auth docs)
// На сторінці "Профіль" зробити зміну пароля та пошти через better-auth
// Перевірити відкриття доступу до сертифікатів одразу багатьом студентам (можливо одразу всім хто зареєстрований на курс)
// Зробити сторінки (Політика конфіденційності та Умови використання)
// Баг при оновленні заходів (можливо тимчасово щоб не путати юзера зробити перезвантаження сторінки з курсами)
// Можливо потрібно вивантажувати в ексель реєстрації студентів по курсам
// Скрол до верху при переході на сторінку
// В останніх реєстраціх (/admin) додати кнопку для перевірки квитанції
// <PageLoader /> зробити по центру
// Перед реэстрацією на захід - обовязково заповнити поля профіля
// Після заповнення обовязкових полів при реєстрації на захід - треба ревалідація юзера
// Видалення реєстрації з адмінки (спочатку не завантажувати всіх юзерів, а потім зробити пошук по піб)
// Зробити редірект на /500 тільки для GET запитів
// Видалити реєстрацію через адмінку
// Замінити кольори на hex або rgb
// Rich text протестувати кнопки

// Безкоштовна участь у заході

// Сертифікат учасника / Сертифікат тренера
// Майстер клас або семінар // брав(ла) участь у роботі || брав(ла) участь у роботі (проведенні)

/* 
Ми використовуємо файли cookie, щоб покращити ваш досвід перегляду, аналізувати трафік сайту, персоналізувати контент і 
показувати цільову рекламу. Дізнайтеся більше про те, як ми використовуємо файли cookie та як ви можете керувати ними, у 
нашій Політиці конфіденційності. Якщо ви продовжуєте користуватися цим сайтом, ви погоджуєтеся на використання 
нами файлів cookie.
*/

/* 
translate better auth errors:
export const authErrors: Record<string, string> = {
  INVALID_ORIGIN: "Невірний домен запиту",
  INVALID_CREDENTIALS: "Невірна пошта або пароль",
  EMAIL_NOT_VERIFIED: "Підтвердіть електронну пошту",
  USER_ALREADY_EXISTS: "Користувач уже існує",
  TOO_MANY_REQUESTS: "Занадто багато запитів. Спробуйте пізніше",
  WAIT: "Зачекайте перед повторною відправкою",
};

export function getAuthErrorMessage(error: any) {
  if (!error?.code) return "Невідома помилка";
  return authErrors[error.code] ?? error.message;
}
*/
