import { createRoot } from "react-dom/client"
import { RouterProvider } from "react-router"

import "./index.css"
import { router } from "./router.tsx"

createRoot(document.getElementById("root")!).render(<RouterProvider router={router} />)

// TODO:
// Захистити роути (DONE! Залишилось перевірити)
// Під час оновлення профілю не оновлюється пошта (DONE! Залишилось перевірити)
// На сторінці "Профіль" зробити зміну пароля та пошти через better-auth (DONE! Залишилось перевірити)
// Можливо потрібно вивантажувати в ексель реєстрації студентів по курсам (DONE! Залишилось доробити)
// Перед реєстрацією на захід - обовязково заповнити поля профіля (DONE! Залишилось перевірити)
// Замінити кольори на hex або rgb  (DONE! Залишилось перевірити)
// Виправити x, y при друку в шаблон  (DONE! Залишилось перевірити)
// Перед збереженням файлів треба робити транслітерацію (DONE! Залишилось перевірити)
// Для шаблону треба зробити для жирність тексту (regular, bold) (DONE! Залишилось перевірити)
// Безкоштовна участь у заході (DONE! Залишилось перевірити)

// Зміна емайла
// Видалення реєстрації з адмінки (спочатку не завантажувати всіх юзерів, а потім зробити пошук по піб)
// Після відправки запиту на безкоштовну участь треба змінити UI в модалці: "Оплата заходу"
// Перевірити підтвердження оплати в <PaymentReceiptDialog />
// В таблиці реєстрацій на сторінці "Всі реєстрації" перевірити чи коректно відображається UI
// Сторінки "Політика конфіденційності" та "Умови використання"
// Збереження файлів в mino
// Cannot GET /course/user/4

// Майстер клас або семінар // брав(ла) участь у роботі || брав(ла) участь у роботі (проведенні)
// Не треба показувати тост "Not authentificated"
// Перевірити чи не зламалась ревалідація queryKey: ["user-registrations"],
// "Сервер недоступний" не треба показувати багато разів
// Перевірити на різних пристроях/емуляторах

/* 
translate better auth errors:
export const authErrors: Record<string, string> = {
  INVALID_ORIGIN: "Невірний домен запиту",
  INVALID_CREDENTIALS: "Невірна пошта або пароль",
  EMAIL_NOT_VERIFIED: "Підтвердіть електронну пошту",
  USER_ALREADY_EXISTS: "Користувач уже існує",
  TOO_MANY_REQUESTS: "Занадто багато запитів. Спробуйте пізніше",
  WAIT: "Зачекайте перед повторною відправкою",
};

export function getAuthErrorMessage(error: any) {
  if (!error?.code) return "Невідома помилка";
  return authErrors[error.code] ?? error.message;
}
*/
