import { createRoot } from "react-dom/client"
import { RouterProvider } from "react-router"

import "./index.css"
import { router } from "./router.tsx"

createRoot(document.getElementById("root")!).render(<RouterProvider router={router} />)

// TODO:
// Баг при оновленні заходів
// Мобільна адаптація
// Кнопка для завантаження сертифікатів (доступність лише після реєстрації та оплати)
// Можливо потрібно вивантажувати в ексель реєстрації студентів по курсам
// Під час оновлення профілю не оновлюється пошта (подивитись в better-auth docs)
// Зробити кнопку "Оплатити зараз" також і на сторінці "Мої заходи". Можливо ще й кнопку "Завантажити сертифікат"
// На сторінці "Управління заходами" додати фільтри, пошук та посторінкове відображення
// Сортування в таблицях
// На головній сторінці, архів курсів - треба відображати тільки 3 останніх
// Зробити сторінки (Політика конфіденційності та Умови використання)
// Зробити підтвердження електронної пошти при реєстрації
// На сторінці "Профіль" зробити зміну пароля та пошти через better-auth
// Перевірити відкриття доступу до сертифікатів одразу багатьом студентам (можливо одразу всім хто зареєстрований на курс)
// Максимальна кількість учасників
// Захистити роути
// Видаляти старий пдф шаблон
// Можливість відмінити Реєстрацію на курс (для учасника)

// Безкоштовна участь у заході
// Ручна реєстрація тренера
