import { createRoot } from "react-dom/client"
import { RouterProvider } from "react-router"

import "./index.css"
import { router } from "./router.tsx"

createRoot(document.getElementById("root")!).render(<RouterProvider router={router} />)

// TODO:
// Мобільна адаптація
// Захистити роути
// Зробити підтвердження електронної пошти при реєстрації
// Під час оновлення профілю не оновлюється пошта (подивитись в better-auth docs)
// На сторінці "Профіль" зробити зміну пароля та пошти через better-auth
// Перевірити відкриття доступу до сертифікатів одразу багатьом студентам (можливо одразу всім хто зареєстрований на курс)
// Максимальна кількість учасників
// Можливість відмінити Реєстрацію на курс (для учасника)
// Зробити сторінки (Політика конфіденційності та Умови використання)
// Різні дати початку та завершення заходу
// Сортування в таблицях
// Баг при оновленні заходів
// Можливо потрібно вивантажувати в ексель реєстрації студентів по курсам

// Безкоштовна участь у заході
// Ручна реєстрація тренера

// Сертифікат учасника / Сертифікат тренера
// Майстер клас або семінар // брав(ла) участь у роботі || брав(ла) участь у роботі (проведенні)
