import { createRoot } from "react-dom/client"
import { RouterProvider } from "react-router"

import "./index.css"
import { router } from "./router.tsx"

createRoot(document.getElementById("root")!).render(<RouterProvider router={router} />)

// TODO:
// Захистити роути 
// Зробити підтвердження електронної пошти при реєстрації
// Під час оновлення профілю не оновлюється пошта (подивитись в better-auth docs)
// На сторінці "Профіль" зробити зміну пароля та пошти через better-auth
// Перевірити відкриття доступу до сертифікатів одразу багатьом студентам (можливо одразу всім хто зареєстрований на курс)
// Зробити сторінки (Політика конфіденційності та Умови використання)
// Різні дати початку та завершення заходу
// Сортування в таблицях
// Баг при оновленні заходів
// Можливо потрібно вивантажувати в ексель реєстрації студентів по курсам
// Скрол до верху при переході на сторінку
// В останніх реєстрація додати кнопку для перевірки квитанції
// Видалення реєстрації з адмінки (спочатку не завантажувати всіх юзерів, а потім зробити пошук по піб)

// Безкоштовна участь у заході
// Ручна реєстрація тренера

// Сертифікат учасника / Сертифікат тренера
// Майстер клас або семінар // брав(ла) участь у роботі || брав(ла) участь у роботі (проведенні)

/* 
Ми використовуємо файли cookie, щоб покращити ваш досвід перегляду, аналізувати трафік сайту, персоналізувати контент і 
показувати цільову рекламу. Дізнайтеся більше про те, як ми використовуємо файли cookie та як ви можете керувати ними, у 
нашій Політиці конфіденційності. Якщо ви продовжуєте користуватися цим сайтом, ви погоджуєтеся на використання 
нами файлів cookie.
*/
